{
    "name": "english",
    "substrings": {
        "ContactLink": "<a class=\"text-backdrop link\" href=\"https://t.me/iwebdeveloper\" target=\"_blank\">create an issue on github</a>"
    },
    "strings": {
        "AppTitleCobalt": "copylink",
        "LinkInput": "the link here...",
        "AboutSummary": "Our platform was created with the goal of helping people discover and share inspiring content from the depths of social media. Our mission is to provide a central hub for downloading high-quality videos from various social media platforms. copylink is available to all users for free! Our platform offers a simple way for content creators, influencers, teachers, and students to download and utilize videos from social media. Whether you're looking for inspirational talks, educational videos, or entertaining clips, copylink provides a wide range of content across different subject areas.",
        "EmbedBriefDescription": "",
        "MadeWithLove": "copylink",
        "AccessibilityInputArea": "link input area",
        "AccessibilityOpenAbout": "open about popup",
        "AccessibilityDownloadButton": "download button",
        "AccessibilityOpenSettings": "open settings popup",
        "AccessibilityOpenDonate": "open donation popup",
        "TitlePopupAbout": "Why copylink ?",
        "TitlePopupSettings": "settings",
        "TitlePopupError": "hoopla...",
        "TitlePopupChangelog": "what's new?",
        "TitlePopupDonate": "Support",
        "TitlePopupDownload": "how to save?",
        "ErrorSomethingWentWrong": "something went wrong and i couldn't get anything for you. try again.",
        "ErrorUnsupported": "it seems like this service is not supported yet or your link is invalid. have you pasted the right link?",
        "ErrorBrokenLink": "{s} is supported, but something is wrong with your link. maybe you didn't copy it fully?",
        "ErrorNoLink": "i can't guess what you want to download! please give me a link :(",
        "ErrorPageRenderFail": "if you're reading this, then there's something wrong with the page renderer. make sure to provide the domain this error is present on and current commit hash ({s}). thank you in advance :D",
        "ErrorRateLimit": "you're making too many requests. try again in a minute!",
        "ErrorCouldntFetch": "i couldn't find anything about this link. check if it works and try again! some content may be region restricted, so keep that in mind.",
        "ErrorLengthLimit": "i can't process videos longer than {s} minutes, so pick something shorter instead!",
        "ErrorBadFetch": "something went wrong when i tried getting info about your link. are you sure it works? check if it does, and try again.",
        "ErrorNoInternet": "there's no internet or Our api is temporarily unavailable. check your connection and try again.",
        "ErrorCantConnectToServiceAPI": "i couldn't connect to the service api. maybe it's down, or our plattform got blocked. try again, but if error persists, {ContactLink}.",
        "ErrorEmptyDownload": "i don't see anything i could download by your link. try a different one!",
        "ErrorLiveVideo": "this is a live video, i am yet to learn how to look into future. wait for the stream to finish and try again!",
        "SettingsAppearanceSubtitle": "appearance",
        "SettingsThemeSubtitle": "theme",
        "SettingsFormatSubtitle": "format",
        "SettingsQualitySubtitle": "quality",
        "SettingsThemeAuto": "auto",
        "SettingsThemeLight": "light",
        "SettingsThemeDark": "dark",
        "SettingsKeepDownloadButton": "keep &gt;&gt; visible",
        "AccessibilityKeepDownloadButton": "keep the download button always visible",
        "SettingsEnableDownloadPopup": "ask how to save",
        "AccessibilityEnableDownloadPopup": "ask what to do with downloads",
        "SettingsQualityDescription": "if selected quality isn't available, closest one is used instead.",
        "LinkGitHubChanges": "&gt;&gt; see previous changes",
        "NoScriptMessage": "We use javascript for api requests and interactive interface. you have to allow javascript to use this site. there are no pesty scripts, pinky promise.",
        "DownloadPopupDescriptionIOS": "easiest way to save videos on ios:\n1. add <a class=\"text-backdrop link\" href=\"{saveToGalleryShortcut}\" target=\"_blank\">this siri shortcut</a>.\n2. press \"share\" above and select \"save to photos\" in appeared share sheet.\nif asked, review the permission request, and press \"always allow\".\n\nalternative method:\npress and hold the download button, hide the video preview, and select \"download linked file\" to download.\nthen, open safari downloads, select the file you downloaded, open share menu, and finally press \"save video\".",
        "DownloadPopupDescription": "download button opens a new tab with requested file. you can disable this popup in settings.",
        "ClickToCopy": "press to copy",
        "Download": "download",
        "CopyURL": "copy",
        "AboutTab": "about",
        "ChangelogTab": "changelog",
        "DonationsTab": "donation",
        "SettingsVideoTab": "video",
        "SettingsAudioTab": "audio",
        "SettingsOtherTab": "other",
        "ChangelogLastMajor": "Upcoming Features and Changes at copylink",
        "AccessibilityModeToggle": "toggle download mode",
        "DonateLinksDescription": "this is the best way to donate if you want me to receive your donation directly.",
        "SettingsAudioFormatBest": "best",
        "SettingsAudioFormatDescription": "when \"best\" format is selected, you get audio the way it is on service's side. it's not re-encoded. everything else will be re-encoded.",
        "Keyphrase": "save what you love",
        "SettingsRemoveWatermark": "disable watermark",
        "ErrorPopupCloseButton": "got it",
        "ErrorLengthAudioConvert": "i can't convert audio longer than {s} minutes. pick \"best\" format if you want to avoid limitations!",
        "SettingsAudioFullTikTok": "full audio",
        "SettingsAudioFullTikTokDescription": "downloads original sound used in the video without any additional changes by the post's author.",
        "ErrorCantGetID": "i couldn't get the full info from the shortened link. make sure it works or try a full one! if issue persists, {ContactLink}.",
        "ErrorNoVideosInTweet": "i couldn't find any media content in this tweet. try another one!",
        "ImagePickerTitle": "pick images to download",
        "ImagePickerDownloadAudio": "download audio",
        "ImagePickerExplanationPC": "right click an image to save it.",
        "ImagePickerExplanationPhone": "press and hold an image to save it.",
        "ErrorNoUrlReturned": "i didn't get a download link from the server. this should never happen. try again, but if it still doesn't work, {ContactLink}.",
        "ErrorUnknownStatus": "i received a response i can't process. this should never happen. try again, but if it still doesn't work, {ContactLink}.",
        "PasteFromClipboard": "paste and download",
        "ChangelogOlder": "",
        "ChangelogPressToExpand": "expand",
        "Miscellaneous": "miscellaneous",
        "ModeToggleAuto": "auto mode",
        "ModeToggleAudio": "audio mode",
        "SettingsDisableNotifications": "hide notifications",
        "MediaPickerTitle": "pick what to save",
        "MediaPickerExplanationPC": "click or right click to download what you want.",
        "MediaPickerExplanationPhone": "press or press and hold to download what you want.",
        "TwitterSpaceWasntRecorded": "this twitter space wasn't recorded, so there's nothing to download. try another one!",
        "ErrorCantProcess": "i couldn't process your request :(\nyou can try again, but if issue persists, please {ContactLink}.",
        "ChangelogPressToHide": "collapse",
        "Donate": "donate",
        "DonateSub": "Help us to stay online",
        "DonateExplanation": "Our commitment is to provide free and valuable services that empower you to access and share inspiring content from social media. <br> <br>We believe in the power of knowledge and creativity, and we're dedicated to making this platform available to everyone, without any cost. Maintaining an online platform requires resources, including server costs, maintenance, and continuous development. <br> <br>To help us keep copylink running smoothly and to continue offering our services for free, we invite you to consider making a donation! <br> <br>Every donation is greatly appreciated and makes a difference. To contribute, simply click on the 'Donate' button below. Your generosity will contribute to the growth and longevity of copylink. <br> <br>Thank you for being a part of our mission to inspire and empower through the sharing of knowledge and creativity. Together, we can make a positive impact and ensure that copylink remains a valuable resource for everyone. Donate today and help us continue our journey together!",
        "DonateVia": "donate via",
        "DonateHireMe": "",
        "SettingsVideoMute": "mute audio",
        "SettingsVideoMuteExplanation": "removes audio from video downloads when possible.",
        "ErrorSoundCloudNoClientId": "i couldn't get the temporary token that's required to download songs from soundcloud. try again, but if issue persists, {ContactLink}.",
        "CollapseServices": "Our services",
        "CollapseSupport": "support",
        "CollapsePrivacy": "privacy policy",
        "ServicesNote": "",
        "FollowSupport": "contact us via instagram or telegram",
        "SupportNote": "We will do our best to answer your request as soon as possible.",
        "SourceCode": "report issues, explore source code, star or fork the repo:",
        "PrivacyPolicy": "Your privacy is important to us. When using the Sharing platform, we do not collect any personal data or information about you. Your activities, downloads, and interactions on our platform remain confidential and are not tracked.The downloaded content is not monitored or analyzed from our end. We do not store any information about the files you download or their usage. <br> Note that you are solely responsible for the content you download through our platform. Our platform takes no responsibility for the content of the downloaded files!",
        "ErrorYTUnavailable": "this youtube video is unavailable, it could be region or age restricted. try another one!",
        "ErrorYTTryOtherCodec": "i couldn't find anything to download with your settings. try another codec or quality!\n\nnote: youtube api sometimes acts unexpectedly. blame google for this, not me.",
        "SettingsCodecSubtitle": "youtube codec",
        "SettingsCodecDescription": "h264: generally better player support, but quality tops out at 1080p.\nav1: low player support, but supports 8k & HDR.\nvp9: usually highest bitrate, preserves most detail. supports 4k & HDR.\n\npick h264 if you want best editor/player/social media compatibility.",
        "SettingsAudioDub": "youtube audio track",
        "SettingsAudioDubDescription": "defines which audio track will be used. if dubbed track isn't available, original video language is used instead.\n\noriginal: original video language is used.\nauto: default browser language is used.",
        "SettingsDubDefault": "original",
        "SettingsDubAuto": "auto",
        "SettingsVimeoPrefer": "vimeo downloads type",
        "SettingsVimeoPreferDescription": "progressive: direct file link to vimeo's cdn. max quality is 1080p.\ndash: video and audio are merged by our plattform into one file. max quality is 4k.\n\npick \"progressive\" if you want best editor/player/social media compatibility. if progressive download isn't available, dash is used instead.",
        "ShareURL": "share",
        "ErrorTweetUnavailable": "couldn't find anything about this tweet. this could be because its visibility is limited. try another one!",
        "ErrorTwitterRIP": "twitter has restricted access to any content to unauthenticated users. while there's a way to get regular tweets, spaces are, unfortunately, impossible to get at this time. i am looking into possible solutions.",
        "UrgentDonate": "Help us to stay online!",
        "PopupCloseDone": "done",
        "Accessibility": "accessibility",
        "SettingsReduceTransparency": "reduce transparency",
        "SettingsDisableAnimations": "disable animations",
        "FeatureErrorGeneric": "your browser doesn't allow or support this feature. check if there are any updates available and try again!",
        "ClipboardErrorFirefox": "you're using firefox where all clipboard reading functionality is disabled.",
        "ClipboardErrorNoPermission": "We can't access the most recent item in your clipboard without your permission.\n\nif you don't want to give access, just paste the link manually instead.\n\nif you do, go to site settings and enable the clipboard permission.",
        "SupportSelfTroubleshooting": "Do you have any questions or suggestions?",
        "AccessibilityGoBack": "go back and close the popup",
        "CollapseKeyboard": "keyboard shortcuts",
        "KeyboardShortcutsIntro": "use keyboard shortcuts:",
        "KeyboardShortcutQuickPaste": "paste the link",
        "KeyboardShortcutClear": "clear link input area",
        "KeyboardShortcutClosePopup": "close all popups",
        "CollapseLegal": "legal informations",
        "FairUse": "Disclaimer: Our platform merely provides a service for downloading content from various sources. We do not assume any responsibility for the nature or content of the downloaded files. The use of downloaded content is solely at the user's own risk. <br> Use of Content: When you download and use content from other sources, please don't forget to add a link to the original source! <br> We do not take responsibility for any copyright infringement or violation of third-party rights resulting from the use of downloaded content.",
        "UrgentFeatureUpdate71": "more supported services!",
        "UrgentThanks": "thank you for support!",
        "SettingsDisableMetadata": "don't add metadata",
        "UrgentNewDomain": "new domain, same cobalt",
        "NewDomainWelcomeTitle": "hey there!",
        "NewDomainWelcome": "cobalt is moving! same features, same owner, simply a more rememberable domain. and still no ads.\n\n<span class=\"text-backdrop\">cobalt.tools</span> is the new main domain, aka where you are now. make sure to update your bookmarks and reinstall the web app!",
        "DataTransferSuccess": "btw, your settings have been transferred automatically :)",
        "DataTransferError": "something went wrong when transferring your preferences. you'll have to open settings and configure cobalt by hand.",
        "SupportNotAffiliated": "cobalt is <span class=\"text-backdrop\">not affiliated</span> with any services listed above.",
        "SponsoredBy": "sponsored by",
        "FilenameTitle": "file name style",
        "FilenamePatternClassic": "classic",
        "FilenamePatternPretty": "pretty",
        "FilenamePatternBasic": "basic",
        "FilenamePatternNerdy": "nerdy",
        "FilenameDescription": "classic: default cobalt file name pattern.\nbasic: title and basic info in brackets.\npretty: title and info in brackets.\nnerdy: title and all info in brackets.\n\nsome services don’t support rich file names and always use the classic style.",
        "Preview": "preview",
        "FilenamePreviewVideoTitle": "Video Title",
        "FilenamePreviewAudioTitle": "Audio Title",
        "FilenamePreviewAudioAuthor": "Audio Author",
        "UrgentFilenameUpdate": "customizable file names!"
    }
}
